  // грокаем алгоритмы стр 27
  // функция бинарного поиска

  // алгоритм, который ищет порядковый номер элемента в отсортированном массиве

  function binarySearch(list, item) {
    let low = 0; // нижняя граница
    let high = list.length - 1; // верхняя граница
    let mid; // номер среднего элемента
    let guess; // число, которое будет сравниваться с загаданным числом

    while (low <= high) {
      mid = Math.floor((low + high) / 2); // нашли номер среднего элемента и округили его в меньшую сторону
      guess = list[mid];
      if (guess === item) { // если текущее значение равно загаданном числу, то возвращем порядковый номер
        return mid
      }
      if (guess > item) { // если значение больше, чем загаданное число то 
        high = mid - 1 // опускаем верхнюю границу поиска
      } else if (guess < item) { // если значение меньше, чем искомый элемент, то
        low = mid + 1 // поднимаем нижнюю границу поиска
      }
    }
    return null

  }

  const arr = [1, 3, 5, 7, 9];
  console.log(binarySearch(arr, 9));
  console.log(binarySearch(arr, 3));
